/*
2.| 3. Було б логічно очікувати, що програма робитиме віднімання від числа а
       числа b, а потім порівнюватиме результат з числом c. Так логічно
       припустити особливо врахочуючи наявність додаткового блока оператора
       else, в якому зазначено що програма має виводити у разі нерівності
       результата віднімання та числа с. Проте в умові if не вистачає ще одного
       знака =, і тому наразі програма просто призначає результат віднімання
       a від b змінній c.
*/

#include <iostream>

using namespace std;

int main()

{

int a, b, c;

cout << "Please enter three numbers) \n";

cout << "a: ";

cin >> a;

cout << "\nb: ";

cin >> b;

cout << "\nc: ";

cin >> c;

if (c = (a - b))

{

     cout << "\na: ";

     cout << a;

     cout << " minus b: ";

     cout << b;

     cout << " equals c: ";

     cout << c << endl;

}

else

     cout << "a - b does not equal c: " << endl;

return 0;

}
