#include <iostream>					// Додає бібліотеку iostream.
using namespace std;				// Вказує використовувати std за замовчуванням, щоб не прописувати це окремо кожен раз при використанні cout.
int main()							// Освновна функція, яка очікує на повернення типу integer.
{									// Фігурна скобка оголошує початок тіла функції.
	int x = 5;						// Оголошення та виначення змінної x з типом int та значенням 5.
	int y = 7;						// Оголошення та виначення змінної y з типом int та значенням 7.
	cout << "\n";					// Виведення в output порожнього рядка.
	cout << x + y << " " << x * y;	// Виведення в output результат додавання і множення змінних x та y відокремлене одним пробілом.
	cout << "\n";					// Виведення в output відступу на новий рядок.
	return 0;						// Повернення функції значення 0. Завершення виконання функції.
}									// Фігурна скобка оголошує кінець тіла функції.